-- phpMyAdmin SQL Dump
-- version 4.6.2
-- https://www.phpmyadmin.net/
--
-- Host: 10.53.216.201:3938
-- Generation Time: 2016-11-08 20:37:03
-- 服务器版本： 5.6.28-log
-- PHP Version: 5.6.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `xiaochu`
--

-- --------------------------------------------------------

--
-- 表的结构 `c_tasks_main`
--

CREATE TABLE `c_tasks_main` (
  `id` int(11) NOT NULL DEFAULT '0',
  `name` varchar(255) DEFAULT NULL,
  `desc` varchar(255) DEFAULT NULL,
  `level` int(11) DEFAULT NULL COMMENT '关卡数',
  `itemid` int(11) DEFAULT NULL,
  `num` int(11) DEFAULT NULL,
  `gold` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `c_tasks_main`
--

INSERT INTO `c_tasks_main` (`id`, `name`, `desc`, `level`, `itemid`, `num`, `gold`) VALUES
(1, '通过第10关', '通过第10关', 10, 2011, 1, 200),
(2, '通过第20关', '通过第20关', 20, 2016, 1, 300),
(3, '通过第30关', '通过第30关', 30, 2016, 1, 400),
(4, '通过第40关', '通过第40关', 40, 2012, 1, 500),
(5, '通过第50关', '通过第50关', 50, 2012, 1, 500),
(6, '通过第60关', '通过第60关', 60, 2011, 1, 500),
(7, '通过第70关', '通过第70关', 70, 2011, 1, 500),
(8, '通过第80关', '通过第80关', 80, 2015, 1, 500),
(9, '通过第90关', '通过第90关', 90, 2015, 1, 500),
(10, '通过第100关', '通过第100关', 100, 2015, 1, 500),
(11, '通过第110关', '通过第110关', 110, 2015, 1, 500),
(12, '通过第120关', '通过第120关', 120, 2015, 1, 500),
(13, '通过第130关', '通过第130关', 130, 2015, 1, 500),
(14, '通过第140关', '通过第140关', 140, 2015, 1, 500),
(15, '通过第150关', '通过第150关', 150, 2015, 1, 500),
(16, '通过第160关', '通过第160关', 160, 2015, 1, 500),
(17, '通过第170关', '通过第170关', 170, 2015, 1, 500),
(18, '通过第180关', '通过第180关', 180, 2015, 1, 500),
(19, '通过第190关', '通过第190关', 190, 2015, 1, 500),
(20, '通过第200关', '通过第200关', 200, 2015, 1, 500),
(21, '通过第210关', '通过第210关', 210, 2015, 1, 500),
(22, '通过第220关', '通过第220关', 220, 2015, 1, 500),
(23, '通过第230关', '通过第230关', 230, 2015, 1, 500),
(24, '通过第240关', '通过第240关', 240, 2012, 1, 500),
(25, '通过第250关', '通过第250关', 250, 2012, 1, 500),
(26, '通过第260关', '通过第260关', 260, 2012, 1, 500),
(27, '通过第270关', '通过第270关', 270, 2012, 1, 500),
(28, '通过第280关', '通过第280关', 280, 2012, 1, 500),
(29, '通过第290关', '通过第290关', 290, 2012, 1, 500),
(30, '通过第300关', '通过第300关', 300, 2012, 1, 500),
(31, '通过第310关', '通过第310关', 310, 2012, 1, 500),
(32, '通过第320关', '通过第320关', 320, 2015, 1, 500),
(33, '通过第330关', '通过第330关', 330, 2015, 1, 500),
(34, '通过第340关', '通过第340关', 340, 2015, 1, 500),
(35, '通过第350关', '通过第350关', 350, 2015, 1, 500),
(36, '通过第360关', '通过第360关', 360, 2015, 1, 500),
(37, '通过第370关', '通过第370关', 370, 2012, 1, 500),
(38, '通过第380关', '通过第380关', 380, 2012, 1, 500),
(39, '通过第390关', '通过第390关', 390, 2012, 1, 500),
(40, '通过第400关', '通过第400关', 400, 2012, 1, 500),
(41, '通过第410关', '通过第410关', 410, 2015, 1, 500),
(42, '通过第420关', '通过第420关', 420, 2015, 1, 500),
(43, '通过第430关', '通过第430关', 430, 2015, 1, 500),
(44, '通过第440关', '通过第440关', 440, 2015, 1, 500),
(45, '通过第450关', '通过第450关', 450, 2015, 1, 500),
(46, '通过第460关', '通过第460关', 460, 2012, 1, 500),
(47, '通过第470关', '通过第470关', 470, 2015, 1, 500),
(48, '通过第480关', '通过第480关', 480, 2012, 1, 500),
(49, '通过第490关', '通过第490关', 490, 2015, 1, 500),
(50, '通过第500关', '通过第500关', 500, 2015, 1, 500);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `c_tasks_main`
--
ALTER TABLE `c_tasks_main`
  ADD PRIMARY KEY (`id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
